app/views/topics/index.html.erb

        <td><%= link_to topic.title, topic_path(topic) %></td>
        <td><%= pluralize(topic.votes.count, "vote") %></td>
---
SELECT COUNT(*) FROM "down_votes" WHERE "down_votes"."topic_id" = ?  [["topic_id", 1]]
SELECT COUNT(*) FROM "votes" WHERE "votes"."topic_id" = ?  [["topic_id", 1]]