app/controllers/topics_controller.rb

SELECT  "topics".* FROM "topics" WHERE "topics"."user_id" = ? AND "topics"."id" = ? LIMIT 1  [["user_id", 1], ["id", 6]]
---
  def edit
    @topic = current_user.topics.find(params[:id])

INSERT INTO "topics" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "kittens"], ["description", "why are kittens so cute"], ["user_id", 1], ["created_at", "2016-07-10 19:55:30.534725"], ["updated_at", "2016-07-10 19:55:30.534725"]]
---
  def create
    @topic = current_user.topics.new(topic_params)

    respond_to do |format|
      if @topic.save

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "votes" ("topic_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["topic_id", 1], ["created_at", "2016-06-25 19:06:29.257380"], ["updated_at", "2016-06-25 19:06:29.257380"]]
---
  def upvote
    @topic = Topic.find(params[:id])
    @topic.votes.create

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "down_votes" ("topic_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["topic_id", 2], ["created_at", "2016-07-10 18:40:35.801598"], ["updated_at", "2016-07-10 18:40:35.801598"]]
INSERT INTO "votes" ("topic_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["topic_id", 2], ["created_at", "2016-06-25 19:28:53.190834"], ["updated_at", "2016-06-25 19:28:53.190834"]]
---
  def downvote
    @topic = Topic.find(params[:id])
    @topic.down_votes.create